# SQL y Pandas

Pandas puede interactuar con diferentes tipos de bases de datos a través de conectores. Estos pueden ser utilizados directamente (conectores nativos) o a través de SQLAlchemy.

Ejemplo de uso de SQLite

In [1]:
import sqlite3
db = sqlite3.connect("DB/flights.db")

In [2]:
import pandas as pd
import numpy as np

airports = pd.read_sql('select * from airports;', con = db).replace('\\N', np.nan)
airlines = pd.read_sql('select * from airlines;', con = db).replace('\\N', np.nan)
routes = pd.read_sql('select * from routes;', con = db).replace('\\N', np.nan)

In [3]:
airports.info()
airlines.info()
routes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8107 entries, 0 to 8106
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   index      8107 non-null   int64
 1   id         8107 non-null   object
 2   name       8107 non-null   object
 3   city       8107 non-null   object
 4   country    8107 non-null   object
 5   code       5880 non-null   object
 6   icao       6785 non-null   object
 7   latitude   8107 non-null   object
 8   longitude  8107 non-null   object
 9   altitude   8107 non-null   object
 10  offset     8107 non-null   object
 11  dst        8107 non-null   object
 12  timezone   8015 non-null   object
dtypes: int64(1), object(12)
memory usage: 823.5+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6048 entries, 0 to 6047
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   index     6048 non-null   int64
 1   id        6048 non-null   object
 2   name      6048 non-null   object
 3   alias     138 non-null    object
 4   iata      1460 non-null   object
 5   icao      5796 non-null   object
 6   callsign  5302 non-null   object
 7   country   6030 non-null   object
 8   active    6048 non-null   object
dtypes: int64(1), object(8)
memory usage: 425.4+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67663 entries, 0 to 67662
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   index       67663 non-null  int64
 1   airline     67663 non-null  object
 2   airline_id  66985 non-null  object
 3   source      67663 non-null  object
 4   source_id   67424 non-null  object
 5   dest        67663 non-null  object
 6   dest_id     67421 non-null  object
 7   codeshare   14597 non-null  object
 8   stops       67663 non-null  object
 9   equipment   67645 non-null  object
dtypes: int64(1), object(9)
memory usage: 5.2+ MB

**SELECT**

In [4]:
# SQL select * from airports where country = 'Spain' and type = 'Madrid'

airports[(airports.country == 'Spain') & (airports.city == 'Madrid')]

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
1201,1201,1224,Getafe,Madrid,Spain,None,LEGT,40.294139,-3.723833,2029,1,E,Europe/Madrid
1206,1206,1229,Barajas,Madrid,Spain,MAD,LEMD,40.493556,-3.566764,2000,1,E,Europe/Madrid
1222,1222,1245,Torrejon,Madrid,Spain,TOJ,LETO,40.496747,-3.445872,2026,1,E,Europe/Madrid
1225,1225,1248,Cuatro Vientos,Madrid,Spain,None,LEVS,40.370678,-3.785144,2267,1,E,Europe/Madrid
8052,8052,9487,Atocha,Madrid,Spain,None,MDAT,40.4075,-3.691667,2188,1,E,Europe/Madrid
8059,8059,9494,Chamartin Station,Madrid,Spain,None,MADC,40.472272,-3.68215,2188,1,E,Europe/Madrid

In [5]:
# SQL select name from airports where country = 'Spain' and type = 'Madrid'

airports[(airports.country == 'Spain') & (airports.city == 'Madrid')]['name']

1201               Getafe
1206              Barajas
1222             Torrejon
1225       Cuatro Vientos
8052               Atocha
8059    Chamartin Station
Name: name, dtype: object

**ORDER_BY**

In [6]:
#SQL select * from airports where country = 'Spain' order by city

airports[airports.country == 'Spain'].sort_values('city')[:10]

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
1189,1189,1211,Albacete,Albacete,Spain,None,LEAB,38.948528,-1.863517,2302,1,E,Europe/Madrid
6832,6832,8261,Algeciras Heliport,Algeciras,Spain,None,NaN,36.128889,-5.441111,98,1,E,Europe/Madrid
6833,6833,8262,Algeciras Heliport,Algeciras,Spain,None,NaN,36.128889,-5.441111,98,1,E,Europe/Madrid
8099,8099,9534,Algerciras Port,Algerciras,Spain,None,NaN,36.136,-5.435,0,1,E,Europe/Madrid
1190,1190,1212,Alicante,Alicante,Spain,ALC,LEAL,38.282169,-0.558156,142,1,E,Europe/Madrid
1191,1191,1213,Almeria,Almeria,Spain,LEI,LEAM,36.843936,-2.370097,70,1,E,Europe/Madrid
6316,6316,7742,Lanzarote Arrecife Cruise Terminal,Arrecife Lanzarote,Spain,None,NaN,28.967298,-13.527528,0,0,E,Atlantic/Canary
1192,1192,1214,Asturias,Aviles,Spain,OVD,LEAS,43.563567,-6.034622,416,1,E,Europe/Madrid
1196,1196,1219,Talavera La Real,Badajoz,Spain,BJZ,LEBZ,38.89125,-6.821333,609,1,E,Europe/Madrid
8061,8061,9496,Aeroport,Barcelona,Spain,None,ARPT,41.288436,2.072409,39,1,E,Europe/Madrid

In [7]:
#SQL select * from airports where country = 'Spain' order by city type desc

airports[airports.country == 'Spain'].sort_values('city', ascending=False)[:20]

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
1229,1229,1252,Zaragoza Ab,Zaragoza,Spain,ZAZ,LEZG,41.666242,-1.041553,863,1,E,Europe/Madrid
1226,1226,1249,Vitoria,Vitoria,Spain,VIT,LEVT,42.882836,-2.724469,1682,1,E,Europe/Madrid
1227,1227,1250,Vigo,Vigo,Spain,VGO,LEVX,42.2318,-8.626775,855,1,E,Europe/Madrid
6321,6321,7747,Vigo Cruise Terminal,Vigo,Spain,None,NaN,42.241537,-8.728799,0,1,E,Europe/Madrid
1224,1224,1247,Valladolid,Valladolid,Spain,VLL,LEVD,41.706111,-4.851944,2775,1,E,Europe/Madrid
1223,1223,1246,Valencia,Valencia,Spain,VLC,LEVC,39.489314,-0.481625,225,1,E,Europe/Madrid
8058,8058,9493,Toledo Railway Station,Toledo,Spain,None,TLDO,39.862363,-4.011083,1736,1,E,Europe/Madrid
1038,1038,1056,Tenerife Sur,Tenerife,Spain,TFS,GCTS,28.044475,-16.572489,209,0,E,Atlantic/Canary
1039,1039,1057,Tenerife Norte,Tenerife,Spain,TFN,GCXO,28.482653,-16.341536,2073,0,E,Atlantic/Canary
6540,6540,7967,Tarifa,Tarifa,Spain,None,NaN,36.070781,-5.602764,20,1,E,Europe/Madrid
1216,1216,1239,Son Bonet,Son Bonet,Spain,None,LESB,39.598889,2.702778,135,1,E,Europe/Madrid
1230,1230,1253,Sevilla,Sevilla,Spain,SVQ,LEZL,37.418,-5.893106,111,1,E,Europe/Madrid
1209,1209,1232,Moron Ab,Sevilla,Spain,OZP,LEMO,37.174917,-5.615944,285,1,E,Europe/Madrid
8049,8049,9484,Santa Justa,Sevilla,Spain,None,SVSJ,37.392051,-5.975135,23,1,E,Europe/Madrid
1221,1221,1244,Seo De Urgel,Seo De Urgel,Spain,LEU,LESU,42.338611,1.409167,2625,1,E,Europe/Madrid
7258,7258,8690,Fuentemilanos Airport,Segovia,Spain,None,LEFM,40.889233,-4.239478,3284,1,E,Europe/Madrid
1220,1220,1243,Santiago,Santiago,Spain,SCQ,LEST,42.896333,-8.415144,1213,1,E,Europe/Madrid
1228,1228,1251,Santander,Santander,Spain,SDR,LEXJ,43.427064,-3.820006,16,1,E,Europe/Madrid
6317,6317,7743,Tenerife Cruise Terminal,Santa Cruz de Tenerife,Spain,None,NaN,28.470068,-16.242471,0,0,E,Atlantic/Canary
1035,1035,1053,La Palma,Santa Cruz De La Palma,Spain,SPC,GCLA,28.626478,-17.755611,107,0,E,Atlantic/Canary

**IN o NOT IN**

In [8]:
#SQL select * from airports where city in ('Santander', 'Tenerife')

airports[airports.city.isin(['Santander', 'Tenerife'])]

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
1038,1038,1056,Tenerife Sur,Tenerife,Spain,TFS,GCTS,28.044475,-16.572489,209,0,E,Atlantic/Canary
1039,1039,1057,Tenerife Norte,Tenerife,Spain,TFN,GCXO,28.482653,-16.341536,2073,0,E,Atlantic/Canary
1228,1228,1251,Santander,Santander,Spain,SDR,LEXJ,43.427064,-3.820006,16,1,E,Europe/Madrid

In [9]:
#SQL select * from airports where city not in ('Santander', 'Tenerife')

airports[~airports.city.isin(['Santander', 'Tenerife'])]

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby
...,...,...,...,...,...,...,...,...,...,...,...,...,...
8102,8102,9537,Mansons Landing Water Aerodrome,Mansons Landing,Canada,YMU,NaN,50.066667,-124.983333,0,-8,A,America/Vancouver
8103,8103,9538,Port McNeill Airport,Port McNeill,Canada,YMP,NaN,50.575556,-127.028611,225,-8,A,America/Vancouver
8104,8104,9539,Sullivan Bay Water Aerodrome,Sullivan Bay,Canada,YTG,NaN,50.883333,-126.833333,0,-8,A,America/Vancouver
8105,8105,9540,Deer Harbor Seaplane,Deer Harbor,United States,DHB,NaN,48.618397,-123.00596,0,-8,A,America/Los_Angeles
8106,8106,9541,San Diego Old Town Transit Center,San Diego,United States,OLT,NaN,32.7552,-117.1995,0,-8,A,America/Los_Angeles

**GROUP BY, COUNT, ORDER BY**

In [10]:
#SQL select country, timezone, count(*) from airports group by country, timezone order by country, timezone

airports.groupby(['country', 'timezone']).size()

country         timezone
Afghanistan     Asia/Kabul           21
Albania         Europe/Tirane         1
Algeria         Africa/Algiers       44
American Samoa  Pacific/Pago_Pago     3
Angola          Africa/Luanda        25
                                     ..
West Bank       Asia/Gaza             1
Western Sahara  Africa/El_Aaiun       3
Yemen           Asia/Aden            11
Zambia          Africa/Lusaka        13
Zimbabwe        Africa/Harare        16
Length: 326, dtype: int64

En Pandas .count() devuelve el número de non-null/NaN values para obtener el mismo resultado que SQL COUNT se debe usar .size().

In [11]:
# SQL select country, timezonte, count(*) from airports group by country, type order by country, count(*) desc

airports.groupby(['country', 'timezone']).size().to_frame('size').reset_index().sort_values(['country', 'size'], ascending=[True, False])

            country           timezone  size
0       Afghanistan         Asia/Kabul    21
1           Albania      Europe/Tirane     1
2           Algeria     Africa/Algiers    44
3    American Samoa  Pacific/Pago_Pago     3
4            Angola      Africa/Luanda    25
..              ...                ...   ...
321       West Bank          Asia/Gaza     1
322  Western Sahara    Africa/El_Aaiun     3
323           Yemen          Asia/Aden    11
324          Zambia      Africa/Lusaka    13
325        Zimbabwe      Africa/Harare    16

[326 rows x 3 columns]

**HAVING**

In [12]:
#SQL select country, count(*) from airports where country = 'United States' group by having count(*) > 5 order by count(*) desc

airports[airports.country == 'United States'].groupby('city').filter(lambda g: len(g) > 5).groupby('city').size().sort_values(ascending=False)

city
New York        13
Seattle          9
Chicago          9
San Diego        8
Philadelphia     6
Houston          6
dtype: int64

In [13]:
vector = [0, 1, -1, -2, 3, -4, 5, 6, 7]
list(filter(lambda x: x > 0, vector))

[1, 3, 5, 6, 7]

**Funciones MIN, MAX, MEDIAN**

In [14]:
#SQL select max(altitude), min(altitude), median(altitude) from airports

airports.agg({'altitude': ['min', 'max', 'median']}).T

          min  max median
altitude  -11  999    272

**JOIN**

In [15]:
#SQL select source, dest from routes join airlines on routes.airline_id = airlines.id where airlines.name = 'Air Europa'

routes.merge(airlines[airlines.name == 'Air Europa'][['id']], left_on='airline_id', right_on='id', how='inner')[['source', 'dest']]

    source dest
0      ACE  BIO
1      ACE  MAD
2      ACE  OVD
3      ACE  SCQ
4      AGP  CDG
..     ...  ...
153    VLC  MAD
154    VLC  PMI
155    VLL  PMI
156    VVI  MAD
157    ZAZ  PMI

[158 rows x 2 columns]

**CREATE**

In [16]:
from datetime import datetime

daily_flights = pd.DataFrame([[
    1, 
    datetime(2016, 9, 29, 0, 0),
    datetime(2016, 9, 29, 12, 0), 
    'T1', 
    1]],
    columns=["id", "departure", "arrival", "number", "route_id"])

daily_flights.to_sql("daily_flights", db, if_exists="replace")

In [17]:
pd.read_sql("select * from daily_flights;", db)

   index  id            departure              arrival number  route_id
0      0   1  2016-09-29 00:00:00  2016-09-29 12:00:00     T1         1

**ALTER**

In [18]:
daily_flights = pd.read_sql("select * from daily_flights", db)

daily_flights["delay_minutes"] = None

daily_flights.to_sql("daily_flights", db, if_exists="replace")

NameError: name 'conn' is not defined

In [0]:
pd.read_sql("select * from daily_flights;", db)

,level_0,index,id,departure,arrival,number,route_id,delay_minutes
0,0,0,1,2016-09-29 00:00:00,2016-09-29 12:00:00,T1,1,None

## Ejercicios

1. Utiliza un conector de SQLAlchemy para cargar la base de datos `flights.db`.
2. Una vez cargados los datos realice las siguientes sentandias SQL con Pandas:
 * ```SELECT * FROM airports WHERE latitude > 20 AND longitude > 20```
 * ```SELECT city FROM airports WHERE country = 'Russia' OR country = 'China'```
 * ```SELECT source COUNT(*) FROM routes GROUP BY source```
 * ```SELECT country, MIN(latitude), MAX(latitude) FROM airports GROUP BY country```
 * ```SELECT airline, airline_id  FROM routes ORDER BY source ASC, dest DESC```

In [ ]:
from sqlalchemy import create_engine